test_data/hotel_property_desc_rq.xml

<soap-env:Envelope 
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" 
    xmlns:xlink="http://www.w3.org/2001/xlink" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap-env:Header>
        <eb:MessageHeader soap-env:mustUnderstand="1" eb:version="2.0.0">
            <eb:From>
                <eb:PartyId type="urn:x12.org:IO5:01">www.rentsomewheels.com</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
            </eb:To>
            <eb:CPAId>DG7F</eb:CPAId>
            <eb:ConversationId>fds8789h|dev@z.com</eb:ConversationId>
            <eb:Service eb:type="sabreXML">HotelPropertyDescription</eb:Service>
            <eb:Action>HotelPropertyDescriptionLLSRQ</eb:Action>
            <eb:MessageData>
                <eb:MessageId>mid:20180216-07:18:42.3|14oUa</eb:MessageId>
                <eb:Timestamp>2018-05-07T20:05:20Z</eb:Timestamp>
            </eb:MessageData>
        </eb:MessageHeader>
        <wsse:Security 
            xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" 
            xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
            <wsse:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESH!ICESMSLB\/RES.LB!-3149273937205173624!1424935!0</wsse:BinarySecurityToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <HotelPropertyDescriptionRQ Version="2.3.0" 
            xmlns="http://webservices.sabre.com/sabreXML/2011/10" 
            xmlns:xs="http://www.w3.org/2001/XMLSchema" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ReturnHostCommand="true">
            <AvailRequestSegment>
                <GuestCounts Count="2"></GuestCounts>
                <HotelSearchCriteria>
                    <Criterion>
                        <HotelRef HotelCode="4"></HotelRef>
                    </Criterion>
                </HotelSearchCriteria>
                <TimeSpan End="05-12" Start="05-11"></TimeSpan>
            </AvailRequestSegment>
        </HotelPropertyDescriptionRQ>
    </soap-env:Body>
</soap-env:Envelope>